wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_hwsem.h
/*!
    \file    gd32h77x_hwsem.h
    \brief   definitions for the HWSEM

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_HWSEM_H
#define GD32H77X_HWSEM_H

#include "gd32h77x.h"

/* HWSEM definitions */
#define HWSEM                      HWSEM_BASE                      /*!< HWSEM base address */

/* registers definitions */
#define HWSEM_CTL0                 REG32(HWSEM + 0x00000000U)      /*!< HWSEM control register 0 */
#define HWSEM_CTL1                 REG32(HWSEM + 0x00000004U)      /*!< HWSEM control register 1 */
#define HWSEM_CTL2                 REG32(HWSEM + 0x00000008U)      /*!< HWSEM control register 2 */
#define HWSEM_CTL3                 REG32(HWSEM + 0x0000000CU)      /*!< HWSEM control register 3 */
#define HWSEM_CTL4                 REG32(HWSEM + 0x00000010U)      /*!< HWSEM control register 4 */
#define HWSEM_CTL5                 REG32(HWSEM + 0x00000014U)      /*!< HWSEM control register 5 */
#define HWSEM_CTL6                 REG32(HWSEM + 0x00000018U)      /*!< HWSEM control register 6 */
#define HWSEM_CTL7                 REG32(HWSEM + 0x0000001CU)      /*!< HWSEM control register 7 */
#define HWSEM_CTL8                 REG32(HWSEM + 0x00000020U)      /*!< HWSEM control register 8 */
#define HWSEM_CTL9                 REG32(HWSEM + 0x00000024U)      /*!< HWSEM control register 9 */
#define HWSEM_CTL10                REG32(HWSEM + 0x00000028U)      /*!< HWSEM control register 10 */
#define HWSEM_CTL11                REG32(HWSEM + 0x0000002CU)      /*!< HWSEM control register 11 */
#define HWSEM_CTL12                REG32(HWSEM + 0x00000030U)      /*!< HWSEM control register 12 */
#define HWSEM_CTL13                REG32(HWSEM + 0x00000034U)      /*!< HWSEM control register 13 */
#define HWSEM_CTL14                REG32(HWSEM + 0x00000038U)      /*!< HWSEM control register 14 */
#define HWSEM_CTL15                REG32(HWSEM + 0x0000003CU)      /*!< HWSEM control register 15 */
#define HWSEM_CTL16                REG32(HWSEM + 0x00000040U)      /*!< HWSEM control register 16 */
#define HWSEM_CTL17                REG32(HWSEM + 0x00000044U)      /*!< HWSEM control register 17 */
#define HWSEM_CTL18                REG32(HWSEM + 0x00000048U)      /*!< HWSEM control register 18 */
#define HWSEM_CTL19                REG32(HWSEM + 0x0000004CU)      /*!< HWSEM control register 19 */
#define HWSEM_CTL20                REG32(HWSEM + 0x00000050U)      /*!< HWSEM control register 20 */
#define HWSEM_CTL21                REG32(HWSEM + 0x00000054U)      /*!< HWSEM control register 21 */
#define HWSEM_CTL22                REG32(HWSEM + 0x00000058U)      /*!< HWSEM control register 22 */
#define HWSEM_CTL23                REG32(HWSEM + 0x0000005CU)      /*!< HWSEM control register 23 */
#define HWSEM_CTL24                REG32(HWSEM + 0x00000060U)      /*!< HWSEM control register 24 */
#define HWSEM_CTL25                REG32(HWSEM + 0x00000064U)      /*!< HWSEM control register 25 */
#define HWSEM_CTL26                REG32(HWSEM + 0x00000068U)      /*!< HWSEM control register 26 */
#define HWSEM_CTL27                REG32(HWSEM + 0x0000006CU)      /*!< HWSEM control register 27 */
#define HWSEM_CTL28                REG32(HWSEM + 0x00000070U)      /*!< HWSEM control register 28 */
#define HWSEM_CTL29                REG32(HWSEM + 0x00000074U)      /*!< HWSEM control register 29 */
#define HWSEM_CTL30                REG32(HWSEM + 0x00000078U)      /*!< HWSEM control register 30 */
#define HWSEM_CTL31                REG32(HWSEM + 0x0000007CU)      /*!< HWSEM control register 31 */
#define HWSEM_RLK0                 REG32(HWSEM + 0x00000080U)      /*!< HWSEM read lock register 0 */
#define HWSEM_RLK1                 REG32(HWSEM + 0x00000084U)      /*!< HWSEM read lock register 1 */
#define HWSEM_RLK2                 REG32(HWSEM + 0x00000088U)      /*!< HWSEM read lock register 2 */
#define HWSEM_RLK3                 REG32(HWSEM + 0x0000008CU)      /*!< HWSEM read lock register 3 */
#define HWSEM_RLK4                 REG32(HWSEM + 0x00000090U)      /*!< HWSEM read lock register 4 */
#define HWSEM_RLK5                 REG32(HWSEM + 0x00000094U)      /*!< HWSEM read lock register 5 */
#define HWSEM_RLK6                 REG32(HWSEM + 0x00000098U)      /*!< HWSEM read lock register 6 */
#define HWSEM_RLK7                 REG32(HWSEM + 0x0000009CU)      /*!< HWSEM read lock register 7 */
#define HWSEM_RLK8                 REG32(HWSEM + 0x000000A0U)      /*!< HWSEM read lock register 8 */
#define HWSEM_RLK9                 REG32(HWSEM + 0x000000A4U)      /*!< HWSEM read lock register 9 */
#define HWSEM_RLK10                REG32(HWSEM + 0x000000A8U)      /*!< HWSEM read lock register 10 */
#define HWSEM_RLK11                REG32(HWSEM + 0x000000ACU)      /*!< HWSEM read lock register 11 */
#define HWSEM_RLK12                REG32(HWSEM + 0x000000B0U)      /*!< HWSEM read lock register 12 */
#define HWSEM_RLK13                REG32(HWSEM + 0x000000B4U)      /*!< HWSEM read lock register 13 */
#define HWSEM_RLK14                REG32(HWSEM + 0x000000B8U)      /*!< HWSEM read lock register 14 */
#define HWSEM_RLK15                REG32(HWSEM + 0x000000BCU)      /*!< HWSEM read lock register 15 */
#define HWSEM_RLK16                REG32(HWSEM + 0x000000C0U)      /*!< HWSEM read lock register 16 */
#define HWSEM_RLK17                REG32(HWSEM + 0x000000C4U)      /*!< HWSEM read lock register 17 */
#define HWSEM_RLK18                REG32(HWSEM + 0x000000C8U)      /*!< HWSEM read lock register 18 */
#define HWSEM_RLK19                REG32(HWSEM + 0x000000CCU)      /*!< HWSEM read lock register 19 */
#define HWSEM_RLK20                REG32(HWSEM + 0x000000D0U)      /*!< HWSEM read lock register 20 */
#define HWSEM_RLK21                REG32(HWSEM + 0x000000D4U)      /*!< HWSEM read lock register 21 */
#define HWSEM_RLK22                REG32(HWSEM + 0x000000D8U)      /*!< HWSEM read lock register 22 */
#define HWSEM_RLK23                REG32(HWSEM + 0x000000DCU)      /*!< HWSEM read lock register 23 */
#define HWSEM_RLK24                REG32(HWSEM + 0x000000E0U)      /*!< HWSEM read lock register 24 */
#define HWSEM_RLK25                REG32(HWSEM + 0x000000E4U)      /*!< HWSEM read lock register 25 */
#define HWSEM_RLK26                REG32(HWSEM + 0x000000E8U)      /*!< HWSEM read lock register 26 */
#define HWSEM_RLK27                REG32(HWSEM + 0x000000ECU)      /*!< HWSEM read lock register 27 */
#define HWSEM_RLK28                REG32(HWSEM + 0x000000F0U)      /*!< HWSEM read lock register 28 */
#define HWSEM_RLK29                REG32(HWSEM + 0x000000F4U)      /*!< HWSEM read lock register 29 */
#define HWSEM_RLK30                REG32(HWSEM + 0x000000F8U)      /*!< HWSEM read lock register 30 */
#define HWSEM_RLK31                REG32(HWSEM + 0x000000FCU)      /*!< HWSEM read lock register 31 */
#define HWSEM_INTEN                REG32(HWSEM + 0x00000100U)      /*!< HWSEM interrupt enable register */
#define HWSEM_INTC                 REG32(HWSEM + 0x00000104U)      /*!< HWSEM interrupt flag clear register */
#define HWSEM_STAT                 REG32(HWSEM + 0x00000108U)      /*!< HWSEM status register */
#define HWSEM_INTF                 REG32(HWSEM + 0x0000010CU)      /*!< HWSEM interrupt flag register */
#define HWSEM_UNLK                 REG32(HWSEM + 0x00000140U)      /*!< HWSEM unlock register */
#define HWSEM_KEY                  REG32(HWSEM + 0x00000144U)      /*!< HWSEM Key register */

