wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_hwsem.h
/* bits definitions */
/* HWSEM_CTLx, x=0..31 */
#define HWSEM_CTL_PID              BITS(0,7)                       /*!< HWSEM process ID */
#define HWSEM_CTL_MID              BITS(8,11)                      /*!< HWSEM master ID */
#define HWSEM_CTL_LK               BIT(31)                         /*!< HWSEM lock */

/* HWSEM_RLKx, x=0..31 */
#define HWSEM_RLK_PID              BITS(0,7)                       /*!< HWSEM read lock register process ID */
#define HWSEM_RLK_MID              BITS(8,11)                      /*!< HWSEM read lock register master ID */
#define HWSEM_RLK_LK               BIT(31)                         /*!< HWSEM read lock register lock */

/* HWSEM_INTEN */
#define HWSEM_INTEN_SIE0           BIT(0)                          /*!< enable HWSEM interrupt for semaphore 0 */
#define HWSEM_INTEN_SIE1           BIT(1)                          /*!< enable HWSEM interrupt for semaphore 1 */
#define HWSEM_INTEN_SIE2           BIT(2)                          /*!< enable HWSEM interrupt for semaphore 2 */
#define HWSEM_INTEN_SIE3           BIT(3)                          /*!< enable HWSEM interrupt for semaphore 3 */
#define HWSEM_INTEN_SIE4           BIT(4)                          /*!< enable HWSEM interrupt for semaphore 4 */
#define HWSEM_INTEN_SIE5           BIT(5)                          /*!< enable HWSEM interrupt for semaphore 5 */
#define HWSEM_INTEN_SIE6           BIT(6)                          /*!< enable HWSEM interrupt for semaphore 6 */
#define HWSEM_INTEN_SIE7           BIT(7)                          /*!< enable HWSEM interrupt for semaphore 7 */
#define HWSEM_INTEN_SIE8           BIT(8)                          /*!< enable HWSEM interrupt for semaphore 8 */
#define HWSEM_INTEN_SIE9           BIT(9)                          /*!< enable HWSEM interrupt for semaphore 9 */
#define HWSEM_INTEN_SIE10          BIT(10)                         /*!< enable HWSEM interrupt for semaphore 10 */
#define HWSEM_INTEN_SIE11          BIT(11)                         /*!< enable HWSEM interrupt for semaphore 11 */
#define HWSEM_INTEN_SIE12          BIT(12)                         /*!< enable HWSEM interrupt for semaphore 12 */
#define HWSEM_INTEN_SIE13          BIT(13)                         /*!< enable HWSEM interrupt for semaphore 13 */
#define HWSEM_INTEN_SIE14          BIT(14)                         /*!< enable HWSEM interrupt for semaphore 14 */
#define HWSEM_INTEN_SIE15          BIT(15)                         /*!< enable HWSEM interrupt for semaphore 15 */
#define HWSEM_INTEN_SIE16          BIT(16)                         /*!< enable HWSEM interrupt for semaphore 16 */
#define HWSEM_INTEN_SIE17          BIT(17)                         /*!< enable HWSEM interrupt for semaphore 17 */
#define HWSEM_INTEN_SIE18          BIT(18)                         /*!< enable HWSEM interrupt for semaphore 18 */
#define HWSEM_INTEN_SIE19          BIT(19)                         /*!< enable HWSEM interrupt for semaphore 19 */
#define HWSEM_INTEN_SIE20          BIT(20)                         /*!< enable HWSEM interrupt for semaphore 20 */
#define HWSEM_INTEN_SIE21          BIT(21)                         /*!< enable HWSEM interrupt for semaphore 21 */
#define HWSEM_INTEN_SIE22          BIT(22)                         /*!< enable HWSEM interrupt for semaphore 22 */
#define HWSEM_INTEN_SIE23          BIT(23)                         /*!< enable HWSEM interrupt for semaphore 23 */
#define HWSEM_INTEN_SIE24          BIT(24)                         /*!< enable HWSEM interrupt for semaphore 24 */
#define HWSEM_INTEN_SIE25          BIT(25)                         /*!< enable HWSEM interrupt for semaphore 25 */
#define HWSEM_INTEN_SIE26          BIT(26)                         /*!< enable HWSEM interrupt for semaphore 26 */
#define HWSEM_INTEN_SIE27          BIT(27)                         /*!< enable HWSEM interrupt for semaphore 27 */
#define HWSEM_INTEN_SIE28          BIT(28)                         /*!< enable HWSEM interrupt for semaphore 28 */
#define HWSEM_INTEN_SIE29          BIT(29)                         /*!< enable HWSEM interrupt for semaphore 29 */
#define HWSEM_INTEN_SIE30          BIT(30)                         /*!< enable HWSEM interrupt for semaphore 30 */
#define HWSEM_INTEN_SIE31          BIT(31)                         /*!< enable HWSEM interrupt for semaphore 31 */

/* HWSEM_INTC */
#define HWSEM_INTC_SIFC0           BIT(0)                          /*!< clear semaphore 0 flag and interrupt flag */
#define HWSEM_INTC_SIFC1           BIT(1)                          /*!< clear semaphore 1 flag and interrupt flag */
#define HWSEM_INTC_SIFC2           BIT(2)                          /*!< clear semaphore 2 flag and interrupt flag */
#define HWSEM_INTC_SIFC3           BIT(3)                          /*!< clear semaphore 3 flag and interrupt flag */
#define HWSEM_INTC_SIFC4           BIT(4)                          /*!< clear semaphore 4 flag and interrupt flag */
#define HWSEM_INTC_SIFC5           BIT(5)                          /*!< clear semaphore 5 flag and interrupt flag */
#define HWSEM_INTC_SIFC6           BIT(6)                          /*!< clear semaphore 6 flag and interrupt flag */
#define HWSEM_INTC_SIFC7           BIT(7)                          /*!< clear semaphore 7 flag and interrupt flag */
#define HWSEM_INTC_SIFC8           BIT(8)                          /*!< clear semaphore 8 flag and interrupt flag */
#define HWSEM_INTC_SIFC9           BIT(9)                          /*!< clear semaphore 9 flag and interrupt flag */
#define HWSEM_INTC_SIFC10          BIT(10)                         /*!< clear semaphore 10 flag and interrupt flag */
#define HWSEM_INTC_SIFC11          BIT(11)                         /*!< clear semaphore 11 flag and interrupt flag */
#define HWSEM_INTC_SIFC12          BIT(12)                         /*!< clear semaphore 12 flag and interrupt flag */
#define HWSEM_INTC_SIFC13          BIT(13)                         /*!< clear semaphore 13 flag and interrupt flag */
#define HWSEM_INTC_SIFC14          BIT(14)                         /*!< clear semaphore 14 flag and interrupt flag */
#define HWSEM_INTC_SIFC15          BIT(15)                         /*!< clear semaphore 15 flag and interrupt flag */
#define HWSEM_INTC_SIFC16          BIT(16)                         /*!< clear semaphore 16 flag and interrupt flag */
#define HWSEM_INTC_SIFC17          BIT(17)                         /*!< clear semaphore 17 flag and interrupt flag */
#define HWSEM_INTC_SIFC18          BIT(18)                         /*!< clear semaphore 18 flag and interrupt flag */
#define HWSEM_INTC_SIFC19          BIT(19)                         /*!< clear semaphore 19 flag and interrupt flag */
#define HWSEM_INTC_SIFC20          BIT(20)                         /*!< clear semaphore 20 flag and interrupt flag */
#define HWSEM_INTC_SIFC21          BIT(21)                         /*!< clear semaphore 21 flag and interrupt flag */
#define HWSEM_INTC_SIFC22          BIT(22)                         /*!< clear semaphore 22 flag and interrupt flag */
#define HWSEM_INTC_SIFC23          BIT(23)                         /*!< clear semaphore 23 flag and interrupt flag */
#define HWSEM_INTC_SIFC24          BIT(24)                         /*!< clear semaphore 24 flag and interrupt flag */
#define HWSEM_INTC_SIFC25          BIT(25)                         /*!< clear semaphore 25 flag and interrupt flag */
#define HWSEM_INTC_SIFC26          BIT(26)                         /*!< clear semaphore 26 flag and interrupt flag */
#define HWSEM_INTC_SIFC27          BIT(27)                         /*!< clear semaphore 27 flag and interrupt flag */
#define HWSEM_INTC_SIFC28          BIT(28)                         /*!< clear semaphore 28 flag and interrupt flag */
#define HWSEM_INTC_SIFC29          BIT(29)                         /*!< clear semaphore 29 flag and interrupt flag */
#define HWSEM_INTC_SIFC30          BIT(30)                         /*!< clear semaphore 30 flag and interrupt flag */
#define HWSEM_INTC_SIFC31          BIT(31)                         /*!< clear semaphore 31 flag and interrupt flag */

/* HWSEM_STAT */
#define HWSEM_STAT_SF0             BIT(0)                          /*!< semaphore 0 unlock event occurs */
#define HWSEM_STAT_SF1             BIT(1)                          /*!< semaphore 1 unlock event occurs */
#define HWSEM_STAT_SF2             BIT(2)                          /*!< semaphore 2 unlock event occurs */
#define HWSEM_STAT_SF3             BIT(3)                          /*!< semaphore 3 unlock event occurs */
#define HWSEM_STAT_SF4             BIT(4)                          /*!< semaphore 4 unlock event occurs */
#define HWSEM_STAT_SF5             BIT(5)                          /*!< semaphore 5 unlock event occurs */
#define HWSEM_STAT_SF6             BIT(6)                          /*!< semaphore 6 unlock event occurs */
#define HWSEM_STAT_SF7             BIT(7)                          /*!< semaphore 7 unlock event occurs */
#define HWSEM_STAT_SF8             BIT(8)                          /*!< semaphore 8 unlock event occurs */
#define HWSEM_STAT_SF9             BIT(9)                          /*!< semaphore 9 unlock event occurs */
#define HWSEM_STAT_SF10            BIT(10)                         /*!< semaphore 10 unlock event occurs */
#define HWSEM_STAT_SF11            BIT(11)                         /*!< semaphore 11 unlock event occurs */
#define HWSEM_STAT_SF12            BIT(12)                         /*!< semaphore 12 unlock event occurs */
#define HWSEM_STAT_SF13            BIT(13)                         /*!< semaphore 13 unlock event occurs */
#define HWSEM_STAT_SF14            BIT(14)                         /*!< semaphore 14 unlock event occurs */
#define HWSEM_STAT_SF15            BIT(15)                         /*!< semaphore 15 unlock event occurs */
#define HWSEM_STAT_SF16            BIT(16)                         /*!< semaphore 16 unlock event occurs */
#define HWSEM_STAT_SF17            BIT(17)                         /*!< semaphore 17 unlock event occurs */
#define HWSEM_STAT_SF18            BIT(18)                         /*!< semaphore 18 unlock event occurs */
#define HWSEM_STAT_SF19            BIT(19)                         /*!< semaphore 19 unlock event occurs */
#define HWSEM_STAT_SF20            BIT(20)                         /*!< semaphore 20 unlock event occurs */
#define HWSEM_STAT_SF21            BIT(21)                         /*!< semaphore 21 unlock event occurs */
#define HWSEM_STAT_SF22            BIT(22)                         /*!< semaphore 22 unlock event occurs */
#define HWSEM_STAT_SF23            BIT(23)                         /*!< semaphore 23 unlock event occurs */
#define HWSEM_STAT_SF24            BIT(24)                         /*!< semaphore 24 unlock event occurs */
#define HWSEM_STAT_SF25            BIT(25)                         /*!< semaphore 25 unlock event occurs */
#define HWSEM_STAT_SF26            BIT(26)                         /*!< semaphore 26 unlock event occurs */
#define HWSEM_STAT_SF27            BIT(27)                         /*!< semaphore 27 unlock event occurs */
#define HWSEM_STAT_SF28            BIT(28)                         /*!< semaphore 28 unlock event occurs */
#define HWSEM_STAT_SF29            BIT(29)                         /*!< semaphore 29 unlock event occurs */
#define HWSEM_STAT_SF30            BIT(30)                         /*!< semaphore 30 unlock event occurs */
#define HWSEM_STAT_SF31            BIT(31)                         /*!< semaphore 31 unlock event occurs */

/* HWSEM_INTF */
#define HWSEM_INTF_SIF0            BIT(0)                          /*!< semaphore 00 interrupt is pending */
#define HWSEM_INTF_SIF1            BIT(1)                          /*!< semaphore 01 interrupt is pending */
#define HWSEM_INTF_SIF2            BIT(2)                          /*!< semaphore 02 interrupt is pending */
#define HWSEM_INTF_SIF3            BIT(3)                          /*!< semaphore 03 interrupt is pending */
#define HWSEM_INTF_SIF4            BIT(4)                          /*!< semaphore 04 interrupt is pending */
#define HWSEM_INTF_SIF5            BIT(5)                          /*!< semaphore 05 interrupt is pending */
#define HWSEM_INTF_SIF6            BIT(6)                          /*!< semaphore 06 interrupt is pending */
#define HWSEM_INTF_SIF7            BIT(7)                          /*!< semaphore 07 interrupt is pending */
#define HWSEM_INTF_SIF8            BIT(8)                          /*!< semaphore 08 interrupt is pending */
#define HWSEM_INTF_SIF9            BIT(9)                          /*!< semaphore 09 interrupt is pending */
#define HWSEM_INTF_SIF10           BIT(10)                         /*!< semaphore 10 interrupt is pending */
#define HWSEM_INTF_SIF11           BIT(11)                         /*!< semaphore 11 interrupt is pending */
#define HWSEM_INTF_SIF12           BIT(12)                         /*!< semaphore 12 interrupt is pending */
#define HWSEM_INTF_SIF13           BIT(13)                         /*!< semaphore 13 interrupt is pending */
#define HWSEM_INTF_SIF14           BIT(14)                         /*!< semaphore 14 interrupt is pending */
#define HWSEM_INTF_SIF15           BIT(15)                         /*!< semaphore 15 interrupt is pending */
#define HWSEM_INTF_SIF16           BIT(16)                         /*!< semaphore 16 interrupt is pending */
#define HWSEM_INTF_SIF17           BIT(17)                         /*!< semaphore 17 interrupt is pending */
#define HWSEM_INTF_SIF18           BIT(18)                         /*!< semaphore 18 interrupt is pending */
#define HWSEM_INTF_SIF19           BIT(19)                         /*!< semaphore 19 interrupt is pending */
#define HWSEM_INTF_SIF20           BIT(20)                         /*!< semaphore 20 interrupt is pending */
#define HWSEM_INTF_SIF21           BIT(21)                         /*!< semaphore 21 interrupt is pending */
#define HWSEM_INTF_SIF22           BIT(22)                         /*!< semaphore 22 interrupt is pending */
#define HWSEM_INTF_SIF23           BIT(23)                         /*!< semaphore 23 interrupt is pending */
#define HWSEM_INTF_SIF24           BIT(24)                         /*!< semaphore 24 interrupt is pending */
#define HWSEM_INTF_SIF25           BIT(25)                         /*!< semaphore 25 interrupt is pending */
#define HWSEM_INTF_SIF26           BIT(26)                         /*!< semaphore 26 interrupt is pending */
#define HWSEM_INTF_SIF27           BIT(27)                         /*!< semaphore 27 interrupt is pending */
#define HWSEM_INTF_SIF28           BIT(28)                         /*!< semaphore 28 interrupt is pending */
#define HWSEM_INTF_SIF29           BIT(29)                         /*!< semaphore 29 interrupt is pending */
#define HWSEM_INTF_SIF30           BIT(30)                         /*!< semaphore 30 interrupt is pending */
#define HWSEM_INTF_SIF31           BIT(31)                         /*!< semaphore 31 interrupt is pending */

/* HWSEM_UNLK */
#define HWSEM_UNLK_MID             BITS(8,11)                       /*!< HWSEM unlock register master ID */
#define HWSEM_UNLK_KEY             BITS(16,31)                      /*!< HWSEM semaphore unlock key */

/* HWSEM_KEY */
#define HWSEM_KEY_KEY              BITS(16,31)                      /*!< key for unlocking all semaphores of a bus master */

/* constants definitions */
/* HWSEM register address */
#define HWSEM_CTL(sem)             REG32(((HWSEM) + 0x0U) + 0x4U * (sem))     /*!< the address of HWSEM semaphore control register */
#define HWSEM_RLK(sem)             REG32(((HWSEM) + 0x80U) + 0x4U * (sem))    /*!< the address of HWSEM semaphore read lock register */

